Tekla Open API Reference for Tekla Structures 2025
InputDefinitionFactory.CreateInputDefinition Method (ViewBase, Point, Point)
 Creates a two-point input definition.
 Namespace: Tekla.Structures.Drawing.Tools
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static DrawingPluginBase.InputDefinition CreateInputDefinition(
	ViewBase view,
	Point point1,
	Point point2
)
Public Shared Function CreateInputDefinition (
	view As ViewBase,
	point1 As Point,
	point2 As Point
) As DrawingPluginBase.InputDefinition
Parameters
view
Type: Tekla.Structures.Drawing.ViewBase
The view to be used in the input.
point1
Type: Tekla.Structures.Geometry3d.Point
The first point to be used in the input.
point2
Type: Tekla.Structures.Geometry3d.Point
The second point to be used in the input.
Return Value
Type: DrawingPluginBase.InputDefinition
The input definition.
See Also
Reference
InputDefinitionFactory Class
CreateInputDefinition Overload
Tekla.Structures.Drawing.Tools Namespace